In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('/Users/nguyennhi/baitapPandas/data/GDPlist.csv',encoding= 'unicode_escape')
df.head()

        Country      Continent  GDP (millions of US$)
0   Afghanistan           Asia                  18181
1       Albania         Europe                  12847
2       Algeria         Africa                 190709
3        Angola         Africa                 100948
4     Argentina  South America                 447644

In [4]:
#shape
df.shape

(125, 3)

In [5]:
#num cols
df.shape[1]

3

In [6]:
#num rows
df.shape[0]

125

In [7]:
#rename
df=df.rename(columns={'Country':'Nuoc','Continent':'Chauluc','GDP (millions of US$)':'GDP(trieu$)'})
df.head()

           Nuoc        Chauluc  GDP(trieu$)
0   Afghanistan           Asia        18181
1       Albania         Europe        12847
2       Algeria         Africa       190709
3        Angola         Africa       100948
4     Argentina  South America       447644

In [8]:
df.insert(df.columns.get_loc('Nuoc') + 1, 'Thanhpho', df['Nuoc'])
df.head()

           Nuoc      Thanhpho        Chauluc  GDP(trieu$)
0   Afghanistan   Afghanistan           Asia        18181
1       Albania       Albania         Europe        12847
2       Algeria       Algeria         Africa       190709
3        Angola        Angola         Africa       100948
4     Argentina     Argentina  South America       447644

In [9]:
df['Thanhpho'] = df['Thanhpho'].str.strip().replace('Vietnam', 'Hanoi')

print(df)

             Nuoc     Thanhpho        Chauluc  GDP(trieu$)
0     Afghanistan  Afghanistan           Asia        18181
1         Albania      Albania         Europe        12847
2         Algeria      Algeria         Africa       190709
3          Angola       Angola         Africa       100948
4       Argentina    Argentina  South America       447644
..            ...          ...            ...          ...
120    Uzbekistan   Uzbekistan           Asia        45353
121     Venezuela    Venezuela  South America       315841
122       Vietnam        Hanoi           Asia       122722
123         Yemen        Yemen         Africa        33675
124        Zambia       Zambia         Africa        19206

[125 rows x 4 columns]

In [10]:
df1 = df.loc[df['Chauluc'] != 'Asia']
print(df1)

               Nuoc       Thanhpho        Chauluc  GDP(trieu$)
1           Albania        Albania         Europe        12847
2           Algeria        Algeria         Africa       190709
3            Angola         Angola         Africa       100948
4         Argentina      Argentina  South America       447644
5         Australia      Australia        Oceania      1488221
..              ...            ...            ...          ...
118   United States  United States  North America     15094025
119         Uruguay        Uruguay  South America        46872
121       Venezuela      Venezuela  South America       315841
123           Yemen          Yemen         Africa        33675
124          Zambia         Zambia         Africa        19206

[89 rows x 4 columns]

In [31]:
dfr=df.drop_duplicates(['Nuoc'],keep='last')
df2= dfr.loc[df['GDP(trieu$)'] > 300000]
df2_sorted=df2.sort_values(by='GDP(trieu$)',ascending=True)
df2_sorted

                      Nuoc              Thanhpho        Chauluc  GDP(trieu$)
46                  Greece                Greece         Europe       303065
121              Venezuela             Venezuela  South America       315841
24                Colombia              Colombia  South America       328422
32                 Denmark               Denmark         Europe       333238
109               Thailand              Thailand           Asia       345649
116   United Arab Emirates  United Arab Emirates           Asia       360136
100           South Africa          South Africa         Africa       408074
6                  Austria               Austria         Europe       419243
4                Argentina             Argentina  South America       447644
107                 Taiwan                Taiwan           Asia       466832
54                    Iran                  Iran           Asia       482445
81                  Norway                Norway         Europe       483650
11                 Belgium               Belgium         Europe       513396
89                  Poland                Poland         Europe       513821
105                 Sweden                Sweden         Europe       538237
94            Saudi Arabia          Saudi Arabia           Asia       577595
106            Switzerland           Switzerland         Europe       636059
112                 Turkey                Turkey           Asia       778089
78             Netherlands           Netherlands         Europe       840433
53               Indonesia             Indonesia           Asia       845680
101            South Korea           South Korea           Asia      1116247
73                  Mexico                Mexico  North America      1154784
5                Australia             Australia        Oceania      1488221
102                  Spain                 Spain         Europe      1493513
52                   India                 India           Asia      1676143
21                  Canada                Canada  North America      1736869
93                  Russia                Russia           Asia      1850401
58                   Italy                 Italy         Europe      2198730
117         United Kingdom        United Kingdom         Europe      2417570
15                  Brazil                Brazil  South America      2492908
41                  France                France         Europe      2776324
44                 Germany               Germany         Europe      3577031
60                   Japan                 Japan           Asia      5869471
23                   China                 China           Asia      7298147
118          United States         United States  North America     15094025

In [54]:
df_GDP=dfr.loc[:,'GDP(trieu$)']

In [55]:
df_GDP.min()

10600

In [34]:
df_GDP.max()

15094025

In [35]:
df_GDP.mode()

0         10600
1         11313
2         12461
3         12655
4         12827
         ...
120     2776324
121     3577031
122     5869471
123     7298147
124    15094025
Name: GDP(trieu$), Length: 125, dtype: int64

In [36]:
df_GDP.mean()

555427.784

In [37]:
df_GDP.median()

96089.0

In [70]:
df_chauluc=df.groupby(['Chauluc'])['GDP(trieu$)'].agg(['sum','mean'])
df_chauluc

                    sum          mean
Chauluc
Africa          1820811  6.278659e+04
Asia           24425891  6.784970e+05
Europe         19139380  5.172805e+05
North America  18238447  1.658041e+06
Oceania         1662727  5.542423e+05
South America   4141217  4.601352e+05